/*Заполните пропуски в следующих утверждениях:
а) Весь ввод и вывод организован в виде /потоков/.
b) /Стандартный/ поток /ввода/ обычно подключен к клавиатуре.
c) /Стандартный/ поток /вывода/ обычно подключен к экрану компьютера.
d) Форматированный вывод выполняется функцией /printf/.
e) Строка управления форматом может содержать /спецификаторы преобразования,
    флаги, ширину полей, точность представления, литеральные символы./
f) Спецификаторы преобразования /d и i/ используются для вывода десятичного
    целого со знаком.
g) Спецификаторы преобразования /o, u, x(X)/ используются для вывода целых
    без знака в восьмеричном,десятичном, шестнадцатеричном форматах соответственно.
h) Модификаторы /h, l/ помещаются перед спецификаторамипреобразования целых
    для вывода целых значений типа short, long.
i) Спецификатор преобразования /e(E)/ используется для вывода значений
    с плавающей точкой в экспоненциальной нотации.
j) Модификатор /L/ помещается перед любым спецификатором преобразования
    значений с плавающей точкой для вывода значений типа long double.
k) Спецификаторы преобразования e, E, f выводят значениес точностью,
     равной /6/ цифрам справа от десятичной точки, если точность 
	 представления не указана.
l) Спецификаторы преобразования /s, c/ используются для вывода
    соответственно строк и символов.
m) Все строки заканчиваются /NULL('\0')/ символом.
n) Ширина поля и точность представления в спецификации преобразования 
    функции printf могут задаваться целочисленным выражением при подстановке /(*)/
	в качестве ширины поля или значения точности и при включении этого 
	целочисленного выражения в список аргументов функции.
o) Флаг /-/ выравнивает выводимое значение по левому краю поля.
p) Флаг /+/ выводит значение вместе со знаком "плюс" или знаком "минус".
q) Ввод с контролем формата выполняется функцией scanf.
r) Для чтения заданных символов из потока и сохранения их в массиве 
    символов используется /набор сканирования/.
s) Спецификатор преобразования /i/ может использоваться для ввода восьмеричных,
    десятичных и шестнадцатеричных целых с необязательным знаком.
t) Спецификаторы преобразования /le, lE, lf, lg, lG/ могут использоваться 
    для ввода значений типа double.
u) /Символ подавления присваивания '*'/ используется для чтения данных 
    из входного потока и отбрасывания их без присваивания переменной.
v) Чтобы показать, что из входного потока должно быть введено 
    определенное число символов и цифр, в спецификации преобразования
	scanf может использоваться  /ширина поля/.
*/
