/*Предположим, что имеется переменная с(содержащая символ), x, y, z являются переменными типа int,
переменные d, e, f являются переменными с плавающей точкой, переменная ptr имеет тип char* и массивы s1[100', s2[100] 
являются массивами типа char. Напишите по одному оператору, чтобы выполнить каждое из следующих заданий.*/


/*а) Преобразуйте символ, хранящийся в переменной с в букву верхнего регистра. Присвойте результат переменной с.*/
c = toupper(c);

/*b) Определите, является ли значение переменной с цифрой. Используйте условную операцию, чтобы при выходе печаталась фразы
"is a" или "is not a".*/
printf(" '%c'%sdigit\n",
       c, isdigit(c) ? " is a " : " is not a ");
/*с) Определите, является ли значение переменной с управляющим символом. Используйте условную операцию, чтобы при выходе
результата печатались фразы "is a" или  "is not a"*/


/*d) Введите с клавиатуры строку текста в массив s1, не используя функцию scanf*/


/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
/**/
